In [36]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib_inline
import matplotlib as plt

In [12]:
sns.set_style('whitegrid')

In [13]:
df = pd.read_excel(r'C:\Users\User\Downloads\sample_pivot.xlsx')

In [14]:
df.head()

        Date Region                 Type  Units  Sales
0 2020-07-11   East  Children's Clothing   18.0    306
1 2020-09-23  North  Children's Clothing   14.0    448
2 2020-04-02  South     Women's Clothing   17.0    425
3 2020-02-28   East  Children's Clothing   26.0    832
4 2020-03-19   West     Women's Clothing    3.0     33

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    1000 non-null   datetime64[ns]
 1   Region  1000 non-null   object
 2   Type    1000 non-null   object
 3   Units   911 non-null    float64
 4   Sales   1000 non-null   int64
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 39.2+ KB

In [16]:
pd.crosstab(df.Region, df.Type, margins=True)

Type    Children's Clothing  Men's Clothing  Women's Clothing   All
Region
East                    113             122               176   411
North                    85              89               142   316
South                    45              39                53   137
West                     42              41                53   136
All                     285             291               424  1000

In [17]:
pd.crosstab(df.Region, df.Type, margins=True, margins_name = 'Total')

Type    Children's Clothing  Men's Clothing  Women's Clothing  Total
Region
East                    113             122               176    411
North                    85              89               142    316
South                    45              39                53    137
West                     42              41                53    136
Total                   285             291               424   1000

In [18]:
pd.crosstab(df.Region, df.Type, margins=True, margins_name='Total', normalize='index')

Type    Children's Clothing  Men's Clothing  Women's Clothing
Region
East               0.274939        0.296837          0.428224
North              0.268987        0.281646          0.449367
South              0.328467        0.284672          0.386861
West               0.308824        0.301471          0.389706
Total              0.285000        0.291000          0.424000

In [19]:
pd.crosstab(index = df.Region, columns = df.Type, values = df.Sales, aggfunc = 'mean')

Type    Children's Clothing  Men's Clothing  Women's Clothing
Region
East             405.743363      423.647541        399.028409
North            438.894118      449.157303        432.528169
South            412.666667      475.435897        418.924528
West             480.523810      465.292683        419.188679

In [20]:
pd.crosstab([df.Region, df.Date.dt.quarter], df.Type)

Type         Children's Clothing  Men's Clothing  Women's Clothing
Region Date
East   1                      29              36                39
       2                      20              40                49
       3                      34              19                44
       4                      30              27                44
North  1                      11              23                36
       2                      24              24                38
       3                      31              19                40
       4                      19              23                28
South  1                      10              14                14
       2                      11               8                16
       3                      11               8                16
       4                      13               9                 7
West   1                      15              13                12
       2                       9               7                11
       3                       7               7                12
       4                      11              14                18

In [21]:
pd.crosstab([df.Region, df.Date.dt.quarter], df.Type, rownames=['Region', 'Quarter'])

Type            Children's Clothing  Men's Clothing  Women's Clothing
Region Quarter
East   1                         29              36                39
       2                         20              40                49
       3                         34              19                44
       4                         30              27                44
North  1                         11              23                36
       2                         24              24                38
       3                         31              19                40
       4                         19              23                28
South  1                         10              14                14
       2                         11               8                16
       3                         11               8                16
       4                         13               9                 7
West   1                         15              13                12
       2                          9               7                11
       3                          7               7                12
       4                         11              14                18

In [22]:
pd.crosstab(df.Region, [df.Type, df.Date.dt.quarter])

Type   Children's Clothing             Men's Clothing              \
Date                     1   2   3   4              1   2   3   4
Region
East                    29  20  34  30             36  40  19  27
North                   11  24  31  19             23  24  19  23
South                   10  11  11  13             14   8   8   9
West                    15   9   7  11             13   7   7  14

Type   Women's Clothing
Date                  1   2   3   4
Region
East                 39  49  44  44
North                36  38  40  28
South                14  16  16   7
West                 12  11  12  18

In [23]:
pd.crosstab(df.Region, [df.Type, df.Date.dt.quarter], colnames=['Type', 'Quarter'])

Type    Children's Clothing             Men's Clothing              \
Quarter                   1   2   3   4              1   2   3   4
Region
East                     29  20  34  30             36  40  19  27
North                    11  24  31  19             23  24  19  23
South                    10  11  11  13             14   8   8   9
West                     15   9   7  11             13   7   7  14

Type    Women's Clothing
Quarter                1   2   3   4
Region
East                  39  49  44  44
North                 36  38  40  28
South                 14  16  16   7
West                  12  11  12  18

In [24]:
pd.crosstab(df.Region, df.Type, normalize='all')

Type    Children's Clothing  Men's Clothing  Women's Clothing
Region
East                  0.113           0.122             0.176
North                 0.085           0.089             0.142
South                 0.045           0.039             0.053
West                  0.042           0.041             0.053

In [38]:
#pd.crosstab(df.Region, df.Type, normalize='index').plot.bar(stacked=True)

## Real World

In [27]:
import pandas as pd

df = pd.read_excel('https://github.com/datagy/pivot_table_pandas/raw/master/sample_pivot.xlsx', parse_dates=['Date'])

print(df.head())

        Date Region                 Type  Units  Sales
0 2020-07-11   East  Children's Clothing   18.0    306
1 2020-09-23  North  Children's Clothing   14.0    448
2 2020-04-02  South     Women's Clothing   17.0    425
3 2020-02-28   East  Children's Clothing   26.0    832
4 2020-03-19   West     Women's Clothing    3.0     33

In [28]:
pd.crosstab(df.Region, df.Type)

# This is the same as:
# pd.crosstab(index = df.Region, columns = df.Type)

Type    Children's Clothing  Men's Clothing  Women's Clothing
Region
East                    113             122               176
North                    85              89               142
South                    45              39                53
West                     42              41                53

In [29]:
# A more financial oriented example
#raw_df = pd.read_excel('https://github.com/chris1610/pbpython/blob/master/data/2018_Sales_Total_v2.xlsx?raw=true')
#raw_df.to_csv('raw_cross_tab.csv' ,index = False)

In [31]:
print(raw_df.head())

   account number                         name       sku  quantity  \
0          740150                   Barton LLC  B1-20000        39
1          714466              Trantow-Barrows  S2-77896        -1
2          218895                    Kulas Inc  B1-69924        23
3          307599  Kassulke, Ondricka and Metz  S1-65481        41
4          412290                Jerde-Hilpert  S2-34077         6

   unit price  ext price                       date
0       86.69    3380.91 2018-01-01 07:21:51.000002
1       63.16     -63.16 2018-01-01 10:00:47.000004
2       90.70    2086.10 2018-01-01 13:24:57.999997
3       21.05     863.05 2018-01-01 15:05:21.999995
4       83.21     499.26 2018-01-01 23:26:55.000003

In [32]:
print(raw_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1507 entries, 0 to 1506
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   account number  1507 non-null   int64
 1   name            1507 non-null   object
 2   sku             1507 non-null   object
 3   quantity        1507 non-null   int64
 4   unit price      1507 non-null   float64
 5   ext price       1507 non-null   float64
 6   date            1507 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(2), int64(2), object(2)
memory usage: 82.5+ KB
None

In [34]:
df = raw_df.groupby(['account number', 'name'])['ext price'].sum().reset_index()

In [39]:

df['ext price'].plot(kind='hist')

In [40]:
df['ext price'].describe()

count        20.000000
mean     101711.287500
std       27037.449673
min       55733.050000
25%       89137.707500
50%      100271.535000
75%      110132.552500
max      184793.700000
Name: ext price, dtype: float64

In [41]:
pd.qcut(df['ext price'], q=4)

0     (55733.049000000006, 89137.708]
1             (89137.708, 100271.535]
2     (55733.049000000006, 89137.708]
3              (110132.552, 184793.7]
4             (89137.708, 100271.535]
5             (89137.708, 100271.535]
6     (55733.049000000006, 89137.708]
7            (100271.535, 110132.552]
8              (110132.552, 184793.7]
9              (110132.552, 184793.7]
10            (89137.708, 100271.535]
11    (55733.049000000006, 89137.708]
12    (55733.049000000006, 89137.708]
13            (89137.708, 100271.535]
14           (100271.535, 110132.552]
15             (110132.552, 184793.7]
16           (100271.535, 110132.552]
17             (110132.552, 184793.7]
18           (100271.535, 110132.552]
19           (100271.535, 110132.552]
Name: ext price, dtype: category
Categories (4, interval[float64]): [(55733.049000000006, 89137.708] < (89137.708, 100271.535] < (100271.535, 110132.552] < (110132.552, 184793.7]]